Repository: MerahRed/repeater
Catalog: lib/l10n/app_*.arb
Languages: ar, ms, ms_arab

source: Home
ar: الرئيسية
ms: Utama
ms_arab: اوتم

source: Memorization Info
ar: معلومات الحفظ
ms: Info Hafazan
ms_arab: اينفو حفظن

source: Has Khatam
ar: تم الختم
ms: Sudah Khatam
ms_arab: سوده ختم

source: Current Juz
ar: الجزء الحالي
ms: Juz Sekarang
ms_arab: جز سكرڠ

source: Current Maqra
ar: المقرأة الحالية
ms: Maqra Sekarang
ms_arab: مقرء سكرڠ

source: Edit Info
ar: تعديل المعلومات
ms: Ubah Info
ms_arab: اوبه اينفو

source: Schedules
ar: الجدول
ms: Jadual
ms_arab: جدوال

# sorry
source: Your schedules will start tomorrow. ☺️
ar: سيبدأ جدولك غدًا ☺️
ms: Jadual anda akan bermula esok. ☺️
ms_arab: جدوال اندا اكن برمولا اسوق. ☺️

source: See Upcoming Schedules
ar: عرض الجداول القادمة
ms: Lihat Jadual Akan Datang
ms_arab: لييهت جدوال اكن داتڠ

source: See Schedules History
ar: عرض سجل الجداول
ms: Lihat Sejarah Jadual
ms_arab: لييهت سجاره جدوال

source: Overall Progress
ar: التقدم العام
ms: Kemajuan Keseluruhan
ms_arab: كماجوان كسلورهان

source: Fully Memorized
ar: تم الحفظ بالكامل
ms: Dihafal Sepenuhnya
ms_arab: دحفال سڤنوهڽ

source: Partially Memorized
ar: تم حفظ جزء منه
ms: Sebahagian Dihafal
ms_arab: سبهڠين دحفال

source: Not Memorized
ar: لم يتم الحفظ
ms: Belum Dihafal
ms_arab: بلوم دحفال

source: Settings
ar: الإعدادات
ms: Tetapan
ms_arab: تتاڤن

# appearance
source: Apperance
ar: المظهر
ms: Penampilan
ms_arab: ڤنٮمڤاكن

source: Theme
ar: السمة
ms: Tema
ms_arab: تيما

# color
source: Color Scheme
ar: نظام الألوان
ms: Skim Warna
ms_arab: سكيم وارنا

source: Language
ar: اللغة
ms: Bahasa
ms_arab: بهاس

# danger
source: Danger Zone
ar: منطقة الخطر
ms: Zon Bahaya
ms_arab: زون باهاي

source: Reset Schedules
ar: إعادة تعيين الجداول
ms: Set Semula Jadual
ms_arab: ست سمولا جدوال

source: Reset Data
ar: إعادة تعيين البيانات
ms: Set Semula Data
ms_arab: ست سمولا داتا

# extra
source: Extras
ar: إضافات
ms: Tambahan
ms_arab: تمبههن

# guide
source: User Guide
ar: دليل المستخدم
ms: Panduan Pengguna
ms_arab: ڤندوان ڤڠڬونا

source: Send Feedback
ar: إرسال ملاحظات
ms: Maklum Balas
ms_arab: ماكلوم بالس

source: Notes
ar: ملاحظات
ms: Nota
ms_arab: نوتا

source: Upcoming Schedules
ar: الجداول القادمة
ms: Jadual Akan Datang
ms_arab: جدوال اكن داتڠ

source: Schedule History
ar: سجل الجداول
ms: Sejarah Jadual
ms_arab: سجاره جدوال

# noHistory
source: No History Found
ar: لم يتم العثور على جداول
ms: Tiada Jadual Dijumpai
ms_arab: تيدق ادا جدوال دجمڤاي

# have
source: Have you finished memorizing the Quran?
ar: هل أتممت حفظ القرآن؟
ms: Sudahkah anda selesai menghafal al-Quran?
ms_arab: سودهكها اندا سليسأي مغحفاز القران؟

# fill
source: Fill in your current memorization info
ar: أدخل معلومات الحفظ الخاصة بك
ms: Isikan maklumat hafalan anda
ms_arab: اييسكن معلومت حفظن اندا

# choose
source: Choose a number between
ar: اختر رقمًا بين
ms: Pilih nombor diantara
ms_arab: ڤيليه نومبور دي انتارا

# confirm
source: Confirm changes
ar: تم
ms: Selesai
ms_arab: سليسأي

source: Invalid Input
ar: إدخال غير صالح
ms: Input tidak sah
ms_arab: اينڤوت تيدق صح

# about
source: An app to assist hafiz in scheduling timetables.
ar: تطبيق لمساعدة الحافظ في جدولة المواعيد.
ms: Aplikasi untuk membantu hafiz dalam menguruskan waktu hafazan.
ms_arab: اپليکاسي اونتوق ممبنتو حافظ دالم مڠوروسكن وقت حفظن.

# resetScheduleAbout
source: The app will generate new schedules as if you are new to the app. Useful if you have edited your memorization info.
ar: سيُنشئ التطبيق جداول جديدة كما لو كنتَ جديدًا عليه. هذا مفيد إذا عدّلتَ معلومات حفظك.
ms: Aplikasi ini akan menjana jadual baharu seolah-olah anda baru menggunakan aplikasi ini. Berguna jika anda telah mengedit maklumat hafalan anda.
ms_arab: اپليکاسي اين اكن منجن جدوال بهارو سءولا-ءولا اڠكا برومڽ ممڬوناكن اپليکاسي اين. برݢونا جوق كالو اڠكا سوده اوبه معلومت حفظن.

# resetDataAbout
source: All app data will be deleted and cannot be restored.
ar: سيتم حذف كافة بيانات التطبيق ولن يمكن استعادتها.
ms: Semua data aplikasi akan dipadamkan dan tidak boleh dipulihkan.
ms_arab: سموا داتا اپليکاسي اكن دڤدم دان تيدق بوليه دڤوليهكن.

source: cancel
ar: يلغي
ms: Tutup
ms_arab: توتوڤ

source: reset
ar: إعادة ضبط
ms: Set Semula
ms_arab: ست سمولا

# noResult
source: No Results.
ar: لا توجد نتائج
ms: Tiada Hasil
ms_arab: تيدق ها سيل

# noInternet
source: No Internet Connection!
ar: لا يوجد اتصال بالإنترنت!
ms: Tiada Rangkaian Internet!
ms_arab: تيدق ڠوبوڠن اينترنيت!

source: Memorized Maqras
ar: المقرأة المحفوظة
ms: Maqra yang telah dihafal
ms_arab: مقرء يڠ تله دحفال

# which
source: Which maqras did you still remember?
ar: أي مقرأة لا تزال تتذكرها؟
ms: Maqra manakah yang anda masih ingat?
ms_arab: مقرء مناكه يڠ اڠكا مسيڽ اينڬت؟

source: Delete
ar: حذف
ms: Buang
ms_arab: بوڠ

source: Today
ar: اليوم
ms: Hari ini
ms_arab: هاري اين

source: Schedule Details
ar: تفاصيل الجدول
ms: Perincian Jadual
ms_arab: ڤرينچيأن جدوال

source: Review Type
ar: النوع
ms: Jenis
ms_arab: جنيس

source: Portion
ar: الجزء
ms: Bahagian
ms_arab: بهاڬين

source: Time
ar: الوقت
ms: Masa
ms_arab: مسا

# typeDetail
source: Type Details
ar: التفاصيل
ms: Butiran
ms_arab: بوتيرن

# sabaqDetails
source: New Memorization
ar: حفظ جديد
ms: Hafazan baharu
ms_arab: حفظن بهارو

# sabqiDetails
source: Review of recent memorized parts
ar: مراجعة الحفظ الجديد
ms: Mengulang bahagian yang baru dihafal
ms_arab: مڠولڠ بهاڬين يڠ بهارو دحفال

# manzilDetails
source: Review Old Memorization
ar: مراجعة الحفظ القديم
ms: Mengulang hafalan lama
ms_arab: مڠولڠ حفظن لام

# completed
source: Mark as Completed
ar: تم
ms: Selesai
ms_arab: سليسأي

# incompleted
source: Mark as Incompleted
ar: لم يكتمل
ms: Belum Selesai
ms_arab: بلوم سليسأي

source: Retry
ar: أعد المحاولة
ms: Cuba Lagi
ms_arab: چوبا لاڬي
